package Massive.package2_ExerciseArray;

import java.util.Arrays;
import java.util.Random;

public class Task2 {

	public static void main(String[] args) {
		Random rnd=new Random();


	}

}
/*Создайте команду1 (название выдумайте, кол-во игр - случайное)
 Выведите на печать.
Создайте команду2 (название выдумайте, кол-во игр - случайное)
 Выведите на печать.
 Создайте массив goalAll, в который объедините голы первой и второй команды.
 Распечатайте.
 Подсчитайте суммарное кол-во голов.
 Примерный вид:
 Команда Зенит
Игра 1 голов 3
Игра 2 голов 1
Игра 3 голов 7
Игра 4 голов 9
------------------------
Команда Факел
Игра 1 голов 0
Игра 2 голов 5
------------------------
Всего голов
3
1
7
9
0
5
Итого: 25 голов
 * */
