package Massive.package2_ExerciseArray;

import java.util.Random;
public class Team {
	Random rnd=new Random();



}
/*Определите в классе Team public текстовое поле nazvanie
  определите public целое поле для количества игр kolgame, сыгранных командой
Определите public массив целых чисел goal  для хранения кол-ва голов,
забитых командой в сезоне.
Создайте конструктор класса с параметрами (строковое название, целое количество игр)
В конструторе задайте значение полю nazvanie и kolgame  и заполните массив
случайными числами (кол-во голов в каждой игре)*/
