import java.util.Random;
import java.util.Scanner;

public class Olya {
    public static void main(String[] args) {

        String[][] SNG = {
                {"Эстония", "Таллин"},
                {"Латвия", "Рига"},
                {"Ливта", "Вильнюс"},
                {"Беларусь", "Минск"},
                {"Украина", "Киев"},
                {"Молдова", "Кишенёв"},
                {"Грузия", "Тбилиси"},
                {"Армения", "Ереван"},
                {"Азербайджан", "Баку"},
                {"Абхазия", "Сухум"},
                {"Южная Осетия", "Цхинвал"},
                {"Казахстан", "Нур-Султан"},
                {"Узбекистан", "Ташкент"},
                {"Туркменистан", "Ашгабат"},
                {"Кигизстан", "Бишкек"},
                {"Таджикистан", "Душанбе"},
        };
        String[][] Europe= {
                {"Исландия", "Рейкьявик"},
                {"Ирландия", "Дублин"},
                {"Великобритания", "Лондон"},
                {"Норвегия", "Осло"},
                {"Швеция", "Стокгольм"},
                {"Финляндия", "Хельсинки"},
                {"Португалия", "Лиссабон"},
                {"Испания", "Мадрид"},
                {"Андорра", "Андорра - ла - Велья"},
                {"Франция", "Париж"},
                {"Монако", "Монако"},
                {"Дания", "Копенгаген"},
                {"Нидерланды", "Амстердам"},
                {"Бельгия", "Брюссель"},
                {"ФРГ", "Берлин"},
                {"Швейцария", "Берн"},
                {"Австрия", "Вена"},
                {"Лихтенштейн", "Вадуц"},
                {"Италия", "Рим"},
                {"Ватикан", "Ватикан"},
                {"Мальта", "Ла-Валетта"},
                {"Кипр", "Никосия"},
                {"Греция", "Афины"},
                {"Сан Марино", "Сан Марино"},
                {"Польша", "Варшава"},
                {"Чехия", "Прага"},
                {"Словакия", "Братислава"},
                {"Венгрия", "Будапешт"},
                {"Румыния", "Бухарест"},
                {"Сербия", "Белград"},
                {"Хорватия", "Загреб"},
                {"Словения", "Любляна"},
                {"Черногория", "Подгорицы"},
                {"Македония", "Скопье"},
                {"Босния и Герцеговина", "Сараево"},
                {"Албания", "Тирана"},
                {"Болгария", "София"},
        };


    }
}
